[
    {
        "name": "What privacy means to us",
        "content": [
            "Our mission is to be transparent and open about how we use your data to help provide you with our service, and we welcome your feedback.",
            "We believe your personal data belongs to you, and should stay under your control.",
            "All our products and services are built with Privacy by Design and by default; we always apply the highest security to data, and treat it with respect.  "
        ]
    },
    {
        "name": "How we communicate this",
        "content": [
            "In this notice, we share how we handle your personal data when you sign up and use our apps, service messaging, platform and website tapmydata.com.",
            "Where we say “we” and “us”, we mean Tapmydata. Where we say “third party” that means anyone who is not you or us. This could be another person or organisation.",
            "We regularly check, review and update our Privacy Notice and include this in updates to our App, so you always know where you stand in our relationship. We last updated this notice on 5 January 2021."
        ]
    },
    {
        "name": "Who we are",
        "content": [
            "Tapmydata is the trading name of Personal Privacy Solutions limited, a company registered in the UK number 11387482. Our address is: 86 Bedminster Parade, Bristol, BS3 4HL.",
            "We are registered by the ICO in the UK number ZA460946."
        ]
    },
    {
        "name": "What information we collect",
        "content": [
            "We try to keep any personal data we collect to the minimum required in order to deliver our service.",
            "You will provide some information yourself, in the form of your: \n\nEmail address\n\nUsername\n\nMobile number",
            "We collect some technical information automatically:\n\nOur website will collect your IP address, and note which browser and device you use, which we use to improve the service\n\nOur apps will collect and store information on your device",
            "Our platform (Tapmydata) collects information on the number of requests made and fulfilled by users and customers, as well as what organisations and companies are asked to provide data. This information is anonymised."
        ]
    },
    {
        "name": "Why we collect information and what we do with it",
        "content": [
            "We need to have a valid reason to use your personal information. It’s called the “lawful basis of processing”, and it simply means the information we need to use to give you a professional service.",
            "We collect information about you so that we can:\n\nDeliver the right services for you\n\nKeep in touch\n\nEnsure security and integrity of your account and data\n\nProvide metrics on use of our service to customers\n\nPlan, develop and improve our services",
            "This information is used to set up and manage your account, so that you can use the app and make requests on our platform. We also use it to deal with your enquiries.",
            "Sometimes we might ask your permission to do things, like when you subscribe to an email. Other times, when you’d reasonably expect us to use your personal information, we don’t ask your permission, but only when the law says it’s fine to use it, and it fits with your rights."
        ]
    },
    {
        "name": "How we store and share information",
        "content": [
            "We only hold the personal data from you which we need in the context of the service we are providing, for as long as that is necessary. We’ll always let you know how long we keep it for, and keep a record of how and when we deleted it.",
            "The personal data you provide is stored separately from us and encrypted. Once your account is set up, we have no access to your information.",
            "You choose if you want Tapmydata to share information with third parties, and it will be in specific circumstances, such as:\n\nValid requests for information\n\nSuspected or confirmed identity fraud or other offences\n\nTo verify your details",
            "We use several companies and services to support our platform. We carefully select these companies, and only share with them what they need to help us provide our service. They include:\n\nAmazon Web Services – We use this for hosting our infrastructure.\n\nPostmark App – We use this for sending transactional emails.\n\nWPEngine – We use this to host our public facing website.\n\nApple App Store – We use this to provide our app to iOS users.\n\nGoogle Play Store – We use this to provide our app to Android users.\n\nUrban Airship – We use this to send you push notifications.\n\nClicksend – We use this to send mobile and voice verifications.\n\nGoogle Gmail API – We use this if you activate the option to scan your Google Mail account to recommend companies for subject access requests.\n\nFabric Crashlytics – We use this for crash reporting within our app.\n\nCoinfirm – For financial risk compliance AML checking.\n\nPassbase – For financial risk compliance KYC identity checking.\n\nHubspot – For marketing newsletter management and service related email sending.",
            "All of these services are located within the European Union."
        ]
    },
    {
        "name": "Your rights",
        "content": [
            "You can see and have the right to request all the information we hold on you by accessing our products and sending a request to the Tapmydata organisation, or by making a request to the address below.",
            "If you need to correct or update your information, you can do so, in the same way."
        ]
    },
    {
        "name": "How you can contact us",
        "content": [
            "Email: privacy@tapmydata.com\n\nAddress: Personal Privacy Solutions Ltd, 86 Bedminster Parade, Bristol, BS3 4HL\n\nWeb: https://tapmydata.com\n\nStill need help? Contact Us at https://tapmydata.com/contact/"
        ]
    }
]