[
    {
      "name": "Tapmydata App Terms",
      "content": [
        "These terms of use (as amended from time to time, the “Terms”) together with any supplemental rules and regulations, such as the Privacy Notice govern your access to and use of the services available on the mobile application and website (collectively, the “App”) operated by Personal Privacy Solutions ltd, UK number 11387482; “Tapmydata” or “we”). Your access to the App and use of our services is subject to your acceptance of and compliance with these Terms. By accessing the App or using our services you agree to accept and be bound by the current version of these Terms."
      ]
    },
    {
      "name": "Functions",
      "content": [
        "Our App enables people to take back control over the use of their personal data, through the following actions:",
        "Request: See what data organisations hold about you.",
        "Store: Verify and store your data in your personal data locker.",
        "Earn: Receive TAP coins to spend in the market place."
      ]
    },
    {
      "name": "Data",
      "content": [
        "Our App provides you with the personal data and other information held on you by third parties based upon your requests made through the App (collectively, the “Personal Data”). We operate platform services for our users driven by legally-recognised rights around the use of their Personal Data. To learn more about how Tapmydata protects your privacy, please see our Privacy Notice. The Personal Data is for your own personal use and Tapmydata makes no representation or warranty as to its accuracy or completeness or that a company will respond to the request made on your behalf."
      ]
    },
    {
      "name": "App form and features",
      "content": [
        "The form, nature and functionalities of the App may change from time to time without prior notice to you. Also, we may discontinue temporarily or permanently operating the App or any features within the App towards you or towards users generally at any time and may not be able to provide you with prior notice. We also retain the right to create limits on the use of storage at our sole discretion at any time without prior notice to you."
      ]
    },
    {
      "name": "App users",
      "content": [
        "We reserve the right at all times (but we will not have an obligation) to remove or refuse to compile any Personal Data and to terminate users. If and to the extent we deem it necessary to (i) satisfy any applicable law, regulation, legal process or governmental request, (ii) enforce these Terms, including investigations of a potential violation thereof, (iii) detect, prevent or otherwise address fraud, security or technical issues, or (iv) protect the rights, property or safety of Tapmydata, its users or the public, we reserve the right to access, read, preserve and disclose any related Personal Data."
      ]
    },
    {
      "name": "Passwords",
      "content": [
        "You are responsible for safeguarding the password you use to access your account and for any actions taken by using your password."
      ]
    },
    {
      "name": "Limitations on use",
      "content": [
        "You are responsible for safeguarding the password you use to access your account and for any actions taken by using your password.",
        "Unlawful Use: You shall not use the App or any Personal Data provided for any unlawful purposes or in furtherance of any illegal activities. International users are required to comply with all applicable local laws regarding online conduct and acceptable content.",
        "Unauthorized Access: You shall not do any of the following while accessing or using the App: (i) access, tamper with or use non-public areas of the App (except for your own account), Tapmydata computer systems or the technical delivery systems of our providers; (ii) probe, scan or test the vulnerability of any system or network or breach or circumvent any security or authentication measures; (iii) attempt to access or search the App or any Personal Data by any means (automated or otherwise) other than through our currently available, published interfaces; or (iv) interfere with or disrupt, or attempt to do so, the access of any user, host or network.",
        "No Misuse: You confirm that you have a customer, member or other pre-existing relationship with the companies you request information from or towards which you exercise any other individual data protection rights, or that you have reason to believe that a company has or could have your Personal Data.",
        "No Spamming: You may not use our App to request information from or exercise any other individual data protection rights under the GDPR towards companies with which you have no pre-existing relationship or of which you have no reason to believe that they may have your Personal Data.",
        "No Reproduction: You shall not reproduce, duplicate, copy, sell, trade or resell the App content or its design and look or any information derived from the App. You are not entitled to modify or redistribute the App content or its design and look or any information or to reproduce, store, link, frame or deep-link it on any other App or in any other medium or format without our prior express consent. Further, you shall not use the App for commercial exploitation in any circumstances.",
        "No Malicious Software and Content: You shall not provide any malicious content intended to damage or disrupt another user’s browser or computer or to compromise any user’s privacy.",
        "Respect for Privacy of Third Parties: You shall not disclose other people’s personal data without their prior expressed consent."
      ]
    },
    {
      "name": "Intellectual property",
      "content": [
        "All copyright, trademark, design, database right, patent and other intellectual property right, title and interest in and to the App will remain the exclusive property of Tapmydata and its licensors. The elements of the App, including without limitation the general design and the imagery are protected by copyright, trademark, design, database right, patent and other laws relating to intellectual property rights of England and Wales. Absent our prior written consent, nothing in these Terms gives you a right to use the Tapmydata name or any of Tapmydata’s trademarks, logos, domain names or other distinctive brand features. You are not entitled to use the content of the App for commercial exploitation in any circumstances. In case you breach the terms of this provision, Tapmydata will have the right to claim damages against you which shall include the right to claim direct, indirect or consequential damages and loss of profits."
      ]
    },
    {
      "name": "Accuracy of data",
      "content": [
        "While we endeavour to ensure the accuracy and security of the Personal Data controlled or processed by us, to the maximum extent permissible under applicable laws neither Tapmydata nor any of its directors, officers, employees, agents, partners, affiliates and licensors may be held responsible for any acts or omissions related to, or errors in, the Personal Data or for any loss or damages which may subsequently arise."
      ]
    },
    {
      "name": "Public networks",
      "content": [
        "Any Personal Data transmitted via the App will pass over public telecommunications networks. While Tapmydata undertakes reasonable best efforts to protect the operation of the App and any transmission of Personal Data, Tapmydata does not give any representation, warranty or undertaking that the operation of the App or any transmission of Personal Data will be secure, uninterrupted or error free."
      ]
    },
    {
      "name": "THIRD PARTIES",
      "content": [
        "The App may contain links to third-party apps or websites or materials supplied by or contained on any third-party app or website which is linked from or to the App. Tapmydata does not accept any responsibility or liability for",
        "* The availability or accuracy of such apps, websites or materials or",
        "* The content, products or services on or available from such apps, websites or materials. Links to such apps, websites or materials do not imply any endorsement by Tapmydata of such apps, websites or materials or the content, products or services available from such apps, websites or materials. You acknowledge sole responsibility for and assume all risks arising from your use of any such apps, websites or materials."
      ]
    },
    {
      "name": "LIMITATIONS",
      "content": [
        "Tapmydata provides the content and functionalities of the App and any Personal Data in good faith, but your access to and use of the App is at your own risk. Tapmydata operates the App on an ‘as is’ and ‘as available’ basis without representation or warranty of any kind, whether express or implied, including without limitation of merchantability, fitness for a particular purpose, availability on an uninterrupted, secure or error-free basis or non-infringement of any copyrights, trademarks, designs, database rights, patents or other intellectual property rights in the jurisdiction in which you access and/or use the App. Tapmydata operates platform services and gives no representation, warranty or undertaking for advice or information, whether oral or written, obtained from Tapmydata or the App, for the completeness, accuracy, timeliness, security or reliability of the App, or that the Personal Data is of satisfactory quality, up-to-date or free from viruses, trojans or other harmful or malicious programs. Tapmydata will not be responsible or liable for any harm to your computer system, loss of data or other harm resulting from your access to or use of the App or for the deletion of, or the failure to store or to transmit, any data or Personal Data and other communications."
      ]
    },
    {
      "name": "Updating terms",
      "content": [
        "These Terms, together with any supplemental rules and regulations, such as the Privacy Notice and the End User License Agreement with the Apple App Store and Google Play, respectively, constitute the entire and exclusive agreement between Tapmydata and you regarding the use of the App, and shall supersede and replace any prior agreements between Tapmydata and you regarding the use of the App. In the event that any provision of these Terms is held to be invalid or unenforceable, the remaining provisions of these Terms shall remain in full force and effect.",
        "We may revise these Terms from time to time. The most current version will be available on our App. Revised Terms shall become effective from the date of publication on the App. By continuing to access the App after those revisions become effective, you agree to and accept to be bound by the revised Terms."
      ]
    },
    {
      "name": "Responsibility of user",
      "content": [
        "You are only allowed to access the App if you are entitled to enter into a binding contract with Tapmydata and are not a person barred from accessing the App according to applicable law. You undertake to access the App solely in compliance with these Terms and all applicable rules and regulations. The App is not directed to any person to whom (by reason of such person’s nationality, residence or otherwise) the publication or availability of the App is prohibited. Persons to whom such restrictions apply must not access the App. If you choose to access the App you are solely responsible for compliance with any applicable laws."
      ]
    },
    {
      "name": "Jurisdiction",
      "content": [
        "If you are a consumer, please note that these terms of use, their subject matter and their formation, are governed by English law. You and we both agree that the courts of England and Wales will have exclusive jurisdiction.",
        "If you are a business, these terms of use, their subject matter and their formation (and any non-contractual disputes or claims) are governed by English law. We both agree to the exclusive jurisdiction of the courts of England and Wales."
      ]
    },
    {
      "name": "How you can contact us",
      "content": [
          "Email: privacy@tapmydata.com\n\nAddress: Personal Privacy Solutions Ltd, 86 Bedminster Parade, Bristol, BS3 4HL\n\nWeb: https://tapmydata.com\n\nStill need help? Contact Us at https://tapmydata.com/contact/"
      ]
    }
  ]